# Входные данные
# Даны два целых числа, каждое число записано в отдельной строке.

# Выходные данные
# Выведите наибольшее из данных чисел.

# Примеры
# входные данные
# 1
# 2
# выходные данные
# 2

N = int(input())
K = int(input())
print(max(K, N))
