# Дана строка. Получите новую строку, вставив между двумя символами исходной строки символ *. Выведите полученную строку.

# Входные данные
# Вводится строка.

# Выходные данные
# Выведите ответ на задачу.

# Примеры
# входные данные
# Python
# выходные данные
# P*y*t*h*o*n

s = list(input())
print('*'.join(s))
